handlers/discount-api/lambda/test/fixtures/digital-subscriptions/eligibility-checker-test2.json

{
  "success": true,
  "id": "8a12820a8b8af331018b9949a8cd0446",
  "accountId": "2c92a0fc7186789b01719c58eaf1450b",
  "accountNumber": "A01065603",
  "accountName": "0015I000003to41QAA",
  "invoiceOwnerAccountId": "2c92a0fc7186789b01719c58eaf1450b",
  "invoiceOwnerAccountNumber": "A01065603",
  "invoiceOwnerAccountName": "0015I000003to41QAA",
  "subscriptionNumber": "A-S01102487",
  "version": 6,
  "revision": "6.0",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2020-04-21",
  "serviceActivationDate": "2020-04-21",
  "customerAcceptanceDate": "2020-05-07",
  "subscriptionStartDate": "2020-04-21",
  "subscriptionEndDate": "2024-04-21",
  "lastBookingDate": "2023-11-04",
  "termStartDate": "2023-04-21",
  "termEndDate": "2024-04-21",
  "initialTerm": 12,
  "initialTermPeriodType": "Month",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "contractedMrr": 14.99,
  "totalContractedValue": 582.53,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "QuoteNumber__QT": null,
  "GifteeIdentityId__c": null,
  "OpportunityName__QT": null,
  "GiftNotificationEmailDate__c": null,
  "Gift_Subscription__c": "No",
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": "8d84aa61-e4de-7c10-0000-00000001f244",
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": "DK0NT24WG",
  "CpqBundleJsonId__QT": null,
  "RedemptionCode__c": null,
  "QuoteType__QT": null,
  "GiftRedemptionDate__c": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "DeliveryAgent__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": "Direct",
  "ActivationDate__c": "2020-04-21T10:50:36.451",
  "UserCancellationReason__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "PromotionCode__c": "DK0NT24WG",
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "billToContact": null,
  "paymentTerm": null,
  "invoiceTemplateId": null,
  "invoiceTemplateName": null,
  "sequenceSetId": null,
  "sequenceSetName": null,
  "soldToContact": null,
  "isLatestVersion": true,
  "cancelReason": null,
  "ratePlans": [
    {
      "id": "8a12820a8b8af331018b9949a8a0043f",
      "lastChangeType": "Remove",
      "productId": "2c92a0fb4edd70c8014edeaa4ddb21e7",
      "productName": "Digital Pack",
      "productSku": "ABC-00000005",
      "productRatePlanId": "2c92a0fb4edd70c8014edeaa4eae220a",
      "productRatePlanNumber": null,
      "ratePlanName": "Digital Pack Monthly",
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": null,
      "ratePlanCharges": [
        {
          "id": "8a12820a8b8af331018b9949a8a00440",
          "originalChargeId": "2c92a0fc7186789b01719c58eb904519",
          "productRatePlanChargeId": "2c92a0fb4edd70c9014edeaa50342192",
          "number": "C-02034184",
          "name": "Digital Pack Monthly",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 5,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1,
          "prorationOption": null,
          "isStackedDiscount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2020-05-07",
          "effectiveEndDate": "2023-12-07",
          "processedThroughDate": "2023-12-07",
          "chargedThroughDate": "2023-12-07",
          "done": true,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 11.99,
          "dmrc": 0,
          "tcv": 515.57,
          "dtcv": -53.555333337,
          "originalOrderDate": "2020-04-21",
          "amendedByOrderOn": "2023-11-04",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP11.99",
          "price": 11.99,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    },
    {
      "id": "8a12820a8b8af331018b9949a8d40448",
      "lastChangeType": "Add",
      "productId": "2c92a0fb4edd70c8014edeaa4ddb21e7",
      "productName": "Digital Pack",
      "productSku": "ABC-00000005",
      "productRatePlanId": "2c92a0fb4edd70c8014edeaa4eae220a",
      "productRatePlanNumber": "PRP-00000022",
      "ratePlanName": "Digital Pack Monthly",
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-04742420",
      "ratePlanCharges": [
        {
          "id": "8a12820a8b8af331018b9949a8d6044a",
          "originalChargeId": "8a12820a8b8af331018b9949a77d0422",
          "productRatePlanChargeId": "2c92a0fb4edd70c9014edeaa50342192",
          "number": "C-04757229",
          "name": "Digital Pack Monthly",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1,
          "prorationOption": null,
          "isStackedDiscount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2023-12-07",
          "effectiveEndDate": "2024-04-21",
          "processedThroughDate": "2024-01-07",
          "chargedThroughDate": "2024-02-07",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 14.99,
          "dmrc": 14.99,
          "tcv": 66.955333338,
          "dtcv": 66.955333338,
          "originalOrderDate": "2023-11-04",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP14.99",
          "price": 14.99,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    },
    {
      "id": "8a12820a8b8af331018b9949a8d8044d",
      "productId": "2c92a0ff5345f9200153559c6d2a3385",
      "productName": "Discounts",
      "productSku": "ABC-00000012",
      "productRatePlanId": "2c92a0ff5345f9220153559d915d5c26",
      "productRatePlanNumber": null,
      "ratePlanName": "Percentage",
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": null,
      "ratePlanCharges": [
        {
          "id": "8a12820a8b8af331018b9949a8da044f",
          "originalChargeId": "2c92a0fc7186789b01719c58eb6a4514",
          "productRatePlanChargeId": "2c92a0fd5345efa10153559e97bb76c6",
          "number": "C-02034183",
          "name": "Percentage",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "DiscountPercentage",
          "uom": null,
          "version": 1,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": "ONETIMERECURRINGUSAGE",
          "discountLevel": "subscription",
          "discountClass": null,
          "billingDay": "DefaultFromCustomer",
          "listPriceBase": null,
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": null,
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": null,
          "prorationOption": null,
          "isStackedDiscount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2020-05-07",
          "effectiveEndDate": "2020-08-07",
          "processedThroughDate": "2020-07-07",
          "chargedThroughDate": "2020-08-07",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Fixed_Period",
          "upToPeriodsType": "Months",
          "upToPeriods": 3,
          "specificEndDate": null,
          "mrr": 0,
          "dmrc": 0,
          "tcv": 0,
          "dtcv": 0,
          "originalOrderDate": "2020-04-21",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "50% discount",
          "price": null,
          "discountAmount": null,
          "discountPercentage": 50
        }
      ]
    }
  ],
  "orderNumber": "O-01589126",
  "externallyManagedBy": null,
  "statusHistory": [
    {
      "startDate": "2020-04-21",
      "endDate": "2024-04-21",
      "status": "Active"
    },
    {
      "startDate": "2024-04-21",
      "endDate": null,
      "status": "OutOfTerm"
    }
  ]
}