handlers/discount-api/test/fixtures/digital-subscriptions/eligibility-checker-test3.json

{
  "success": true,
  "id": "8ad092ff8b94cef0018b98eb9cf042e7",
  "accountId": "2c92c0f975798642017594c2133e7741",
  "accountNumber": "A00081975",
  "accountName": "0019E00001JUxAkQAL",
  "invoiceOwnerAccountId": "2c92c0f975798642017594c2133e7741",
  "invoiceOwnerAccountNumber": "A00081975",
  "invoiceOwnerAccountName": "0019E00001JUxAkQAL",
  "subscriptionNumber": "A-S00105942",
  "version": 4,
  "revision": "4.0",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2020-11-04",
  "serviceActivationDate": "2020-11-04",
  "customerAcceptanceDate": "2020-11-20",
  "subscriptionStartDate": "2020-11-04",
  "subscriptionEndDate": "2024-11-04",
  "lastBookingDate": "2023-11-04",
  "termStartDate": "2023-11-04",
  "termEndDate": "2024-11-04",
  "initialTerm": 12,
  "initialTermPeriodType": "Month",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "contractedMrr": 9.92,
  "totalContractedValue": 470.88,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "AcquisitionMetadata__c": null,
  "QuoteNumber__QT": null,
  "GifteeIdentityId__c": null,
  "OpportunityName__QT": null,
  "LastQSSPaymentDate__c": null,
  "GiftNotificationEmailDate__c": null,
  "Gift_Subscription__c": "No",
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": "e418165e-d9b7-abd9-0000-0000000013fc",
  "ActivationDate3__c": null,
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": "ANNUAL-INTRO-UK",
  "Suspended__c": "false",
  "CpqBundleJsonId__QT": null,
  "RedemptionCode__c": null,
  "QuoteType__QT": null,
  "GiftRedemptionDate__c": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "DeliveryAgent__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": "Direct",
  "ActivationDate__c": null,
  "UserCancellationReason__c": null,
  "SuspensionStatus__c": "Active",
  "CardCountry__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "CancelledBy__c": null,
  "dummy__c": null,
  "PromotionCode__c": "ANNUAL-INTRO-UK",
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "billToContact": null,
  "paymentTerm": null,
  "invoiceTemplateId": null,
  "invoiceTemplateName": null,
  "sequenceSetId": null,
  "sequenceSetName": null,
  "soldToContact": null,
  "isLatestVersion": true,
  "cancelReason": null,
  "ratePlans": [
    {
      "id": "8ad092ff8b94cef0018b98eb9cfc42ea",
      "productId": "2c92c0f852f2ebec0152f92523ec0f31",
      "productName": "Promotions",
      "productSku": "SKU-00000031",
      "productRatePlanId": "2c92c0f852f2ebb20152f9269f067819",
      "productRatePlanNumber": null,
      "ratePlanName": "30% off for 3 months",
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": null,
      "ratePlanCharges": [
        {
          "id": "8ad092ff8b94cef0018b98eb9d0042ec",
          "originalChargeId": "2c92c0f975798642017594c218f47792",
          "productRatePlanChargeId": "2c92c0f952f30dc30152f92b2ee62707",
          "number": "C-00151723",
          "name": "Discount template",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "DiscountPercentage",
          "uom": null,
          "version": 2,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": "ONETIMERECURRINGUSAGE",
          "discountLevel": "subscription",
          "discountClass": null,
          "billingDay": "DefaultFromCustomer",
          "listPriceBase": null,
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": null,
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": null,
          "prorationOption": null,
          "isStackedDiscount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2020-11-20",
          "effectiveEndDate": "2021-11-20",
          "processedThroughDate": "2020-11-20",
          "chargedThroughDate": "2020-12-20",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Fixed_Period",
          "upToPeriodsType": "Months",
          "upToPeriods": 12,
          "specificEndDate": null,
          "mrr": 0,
          "dmrc": 0,
          "tcv": 0,
          "dtcv": 0,
          "originalOrderDate": "2020-11-04",
          "amendedByOrderOn": "2021-02-24",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "16.81% discount",
          "price": null,
          "discountAmount": null,
          "discountPercentage": 16.81
        }
      ]
    },
    {
      "id": "8ad092ff8b94cef0018b98eb9d0642f0",
      "productId": "2c92c0f84b786da2014b91d3629b4298",
      "productName": "Digital Pack",
      "productSku": "SKU-00000022",
      "productRatePlanId": "2c92c0f94bbffaaa014bc6a4212e205b",
      "productRatePlanNumber": null,
      "ratePlanName": "Digital Pack Annual",
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": null,
      "ratePlanCharges": [
        {
          "id": "8ad092ff8b94cef0018b98eb9d0a42f2",
          "originalChargeId": "2c92c0f975798642017594c219257799",
          "productRatePlanChargeId": "2c92c0f94bbffaaa014bc6a4213e205d",
          "number": "C-00151724",
          "name": "Digital Pack Annual",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 4,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Annual",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1,
          "prorationOption": null,
          "isStackedDiscount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2020-11-20",
          "effectiveEndDate": "2024-11-04",
          "processedThroughDate": "2023-11-20",
          "chargedThroughDate": "2024-11-20",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 9.916666667,
          "dmrc": 0,
          "tcv": 470.881720433,
          "dtcv": 119,
          "originalOrderDate": "2020-11-04",
          "amendedByOrderOn": "2023-11-04",
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP119",
          "price": 119,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    }
  ],
  "orderNumber": "O-00655525",
  "externallyManagedBy": null,
  "statusHistory": [
    {
      "startDate": "2020-11-04",
      "endDate": "2024-11-04",
      "status": "Active"
    },
    {
      "startDate": "2024-11-04",
      "endDate": null,
      "status": "OutOfTerm"
    }
  ],
  "invoiceGroupNumber": null
}