handlers/discount-api/test/fixtures/supporter-plus/full-price.json

{
  "success": true,
  "id": "8ad099a98fd3f023018fe2d56296299e",
  "accountId": "8ad099a98fd3f023018fe2d562012994",
  "accountNumber": "A00908474",
  "accountName": "001UD000005KmnDYAS",
  "invoiceOwnerAccountId": "8ad099a98fd3f023018fe2d562012994",
  "invoiceOwnerAccountNumber": "A00908474",
  "invoiceOwnerAccountName": "001UD000005KmnDYAS",
  "subscriptionNumber": "A-S00894132",
  "version": 1,
  "revision": "1.0",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2024-06-04",
  "serviceActivationDate": "2024-06-04",
  "customerAcceptanceDate": "2024-06-04",
  "subscriptionStartDate": "2024-06-04",
  "subscriptionEndDate": "2025-06-04",
  "lastBookingDate": "2024-06-04",
  "termStartDate": "2024-06-04",
  "termEndDate": "2025-06-04",
  "initialTerm": 12,
  "initialTermPeriodType": "Month",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "currency": "GBP",
  "contractedMrr": 10.00,
  "totalContractedValue": 120.00,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "CanadaHandDelivery__c": null,
  "AcquisitionMetadata__c": null,
  "QuoteNumber__QT": null,
  "GifteeIdentityId__c": null,
  "OpportunityName__QT": null,
  "LastQSSPaymentDate__c": null,
  "GiftNotificationEmailDate__c": null,
  "Gift_Subscription__c": "No",
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": "4f8fc29d-5df9-ec5b-0000-000000004f95",
  "ActivationDate3__c": null,
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": "E2E_TEST_SPLUS_DEFAULT_ANNUAL",
  "Suspended__c": "false",
  "CpqBundleJsonId__QT": null,
  "RedemptionCode__c": null,
  "QuoteType__QT": null,
  "GiftRedemptionDate__c": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "legacy_cat__c": null,
  "DeliveryAgent__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": "Direct",
  "ActivationDate__c": null,
  "UserCancellationReason__c": null,
  "SuspensionStatus__c": "Active",
  "CardCountry__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "CancelledBy__c": null,
  "dummy__c": null,
  "PromotionCode__c": "E2E_TEST_SPLUS_DEFAULT_ANNUAL",
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "billToContact": {
    "id": "8ad099a98fd3f023018fe2d562422997",
    "address1": null,
    "address2": null,
    "city": null,
    "country": "United Kingdom",
    "county": null,
    "fax": null,
    "state": null,
    "postalCode": null,
    "firstName": "first",
    "lastName": "last",
    "nickname": null,
    "workEmail": "testing123@guardian.co.uk",
    "personalEmail": null,
    "homePhone": null,
    "mobilePhone": null,
    "otherPhone": null,
    "otherPhoneType": null,
    "taxRegion": null,
    "workPhone": null,
    "contactDescription": null,
    "Company_Name__c": null,
    "SpecialDeliveryInstructions__c": null,
    "Title__c": null,
    "zipCode": null,
    "accountId": "8ad099a98fd3f023018fe2d562012994",
    "accountNumber": "A00908474"
  },
  "paymentTerm": null,
  "invoiceTemplateId": null,
  "invoiceTemplateName": null,
  "sequenceSetId": null,
  "sequenceSetName": null,
  "soldToContact": {
    "id": "8ad099a98fd3f023018fe2d562422997",
    "address1": null,
    "address2": null,
    "city": null,
    "country": "United Kingdom",
    "county": null,
    "fax": null,
    "state": null,
    "postalCode": null,
    "firstName": "first",
    "lastName": "last",
    "nickname": null,
    "workEmail": "testing123@guardian.co.uk",
    "personalEmail": null,
    "homePhone": null,
    "mobilePhone": null,
    "otherPhone": null,
    "otherPhoneType": null,
    "taxRegion": null,
    "workPhone": null,
    "contactDescription": null,
    "Company_Name__c": null,
    "SpecialDeliveryInstructions__c": null,
    "Title__c": null,
    "zipCode": null,
    "accountId": "8ad099a98fd3f023018fe2d562012994",
    "accountNumber": "A00908474"
  },
  "isLatestVersion": true,
  "cancelReason": null,
  "ratePlans": [
    {
      "id": "8ad099a98fd3f023018fe2d562a829a0",
      "productId": "2c92c0f85721ff7c01572940171363db",
      "productName": "Discounts",
      "productSku": "SKU-00000044",
      "productRatePlanId": "2c92c0f85721ff7c01572942235b6d7a",
      "productRatePlanNumber": "PRP-00000107",
      "ratePlanName": "Percentage",
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-01506298",
      "ratePlanCharges": [
        {
          "id": "8ad099a98fd3f023018fe2d562c929a7",
          "originalChargeId": "8ad099a98fd3f023018fe2d562c929a7",
          "productRatePlanChargeId": "2c92c0f957220b5d0157299c97a60bbd",
          "number": "C-01559327",
          "name": "Percentage",
          "productRatePlanChargeNumber": "PRPC-00000169",
          "type": "Recurring",
          "model": "DiscountPercentage",
          "uom": null,
          "version": 1,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": "ONETIMERECURRINGUSAGE",
          "discountLevel": "subscription",
          "discountClass": null,
          "billingDay": "DefaultFromCustomer",
          "listPriceBase": null,
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": null,
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": null,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2024-06-04",
          "effectiveEndDate": "2024-07-04",
          "processedThroughDate": "2024-06-04",
          "chargedThroughDate": "2024-07-04",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Fixed_Period",
          "upToPeriodsType": "Months",
          "upToPeriods": 1,
          "specificEndDate": null,
          "mrr": 0.000000000,
          "dmrc": 0.000000000,
          "tcv": 0.000000000,
          "dtcv": 0.000000000,
          "originalOrderDate": "2024-06-04",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "1%  discount",
          "price": null,
          "discountAmount": null,
          "discountPercentage": 1.000000000
        }
      ]
    },
    {
      "id": "8ad099a98fd3f023018fe2d562de29a8",
      "productId": "8ad09fc281de1ce70181de3b23b2363d",
      "productName": "Supporter Plus",
      "productSku": "SKU-00000072",
      "productRatePlanId": "8ad08cbd8586721c01858804e3275376",
      "productRatePlanNumber": "PRP-00000225",
      "ratePlanName": "Supporter Plus V2 - Monthly",
      "subscriptionProductFeatures": [],
      "externallyManagedPlanId": null,
      "subscriptionRatePlanNumber": "SRP-01506299",
      "ratePlanCharges": [
        {
          "id": "8ad099a98fd3f023018fe2d5630729b2",
          "originalChargeId": "8ad099a98fd3f023018fe2d5630729b2",
          "productRatePlanChargeId": "8ad08cbd8586721c01858804e3715378",
          "number": "C-01559328",
          "name": "Subscription",
          "productRatePlanChargeNumber": "PRPC-00000361",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2024-06-04",
          "effectiveEndDate": "2025-06-04",
          "processedThroughDate": "2024-06-04",
          "chargedThroughDate": "2024-07-04",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 10.000000000,
          "dmrc": 10.000000000,
          "tcv": 120.000000000,
          "dtcv": 120.000000000,
          "originalOrderDate": "2024-06-04",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP10",
          "price": 10.000000000,
          "discountAmount": null,
          "discountPercentage": null
        },
        {
          "id": "8ad099a98fd3f023018fe2d5630f29b3",
          "originalChargeId": "8ad099a98fd3f023018fe2d5630f29b3",
          "productRatePlanChargeId": "8ad09ea0858682bb0185880ac57f4c4c",
          "number": "C-01559329",
          "name": "Contribution",
          "productRatePlanChargeNumber": null,
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "subscriptionChargeDeliverySchedule": null,
          "numberOfDeliveries": null,
          "priceChangeOption": "NoChange",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "chargeModelConfiguration": null,
          "inputArgumentId": null,
          "includedUnits": null,
          "overagePrice": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "specificListPriceBase": null,
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "ratingGroup": null,
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "prorationOption": null,
          "isStackedDiscount": false,
          "reflectDiscountInNetAmount": false,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2024-06-04",
          "effectiveEndDate": "2025-06-04",
          "processedThroughDate": "2024-06-04",
          "chargedThroughDate": "2024-07-04",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 0.000000000,
          "dmrc": 0.000000000,
          "tcv": 0.000000000,
          "dtcv": 0.000000000,
          "originalOrderDate": "2024-06-04",
          "amendedByOrderOn": null,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null,
          "ForceSync__c": null,
          "salesPrice": null,
          "tiers": null,
          "discountApplyDetails": null,
          "pricingSummary": "GBP0",
          "price": 0.000000000,
          "discountAmount": null,
          "discountPercentage": null
        }
      ]
    }
  ],
  "externallyManagedBy": null,
  "statusHistory": [
    {
      "startDate": "2024-06-04",
      "endDate": "2025-06-04",
      "status": "Active"
    },
    {
      "startDate": "2025-06-04",
      "endDate": null,
      "status": "OutOfTerm"
    }
  ],
  "invoiceGroupNumber": null,
  "createTime": "2024-06-04 11:39:46",
  "updateTime": "2024-06-04 11:39:46"
}